[
    {
      "id": 1,
      "date": "12 Feburary, 2023",
      "title": "The HR Conclave 2023 ",
      "image": "./HR_Conclave.jpg",
      "description": "The groundbreaking third edition of HR Conclave 2023 made history at IIT Dharwad on 12th February 2023, marking the first-ever offline event of its kind. Hosted by the esteemed Career Development Council (CDC) of IIT Dharwad, the Conclave captivated audiences through a series of two riveting panel discussions featuring industry stalwarts.",
      "time": "10 am - 5 pm",
      "venue":"Auditorium",
      "registrationtimeopen":"Dec 17, 2023 15:37:25",
      "registrationtimeclose":"Dec 19, 2023 18:37:25",
      "details": "Moonlighting : the practice of undertaking secondary employment alongside a traditional 9-to-5 job. Downsizing : which involves reducing the size of a company by eliminating employees. This enlightening discussion on various facets of the corporate world, coupled with the panelist's invaluable guidance on transcending the role of mere manpower and becoming skillful individuals, left an indelible impression on the eager students present. The Conclave culminated in a grand felicitation of the esteemed panelists, who had shared their wisdom and experiences, and a resounding vote of thanks, symbolizing the appreciation and gratitude of all attendees."
    },
    {
      "id": 2,
      "date": "19 October, 2023",
      "title": "Study and Research in Germany",
      "image": "./phdingermany.jpeg",
      "description": "Explore Opportunities in Germany!",
      "time": "2:30 pm - 3:45 pm",
      "venue":"Auditorium",
      "registrationtimeopen":"Dec 17, 2023 15:37:25",
      "registrationtimeclose":"Dec 19, 2023 18:37:25",
      "details": "Join us for an enlightening talk on 'Study and Research in Germany' featuring esteemed guest speakers: Dr. Manjula Mundakana, Senior Advisor, Science Technology and Political AffairsConsulate General of the Federal Republic of Germany, Bengaluru and Dr. R. Madhan Director, Indo-German Science & Technology Centre (IGSTC), New Delhi. Participate in the Q&A session to gain valuable insights and guidance for your academic and research pursuits in Germany. Don't miss this incredible opportunity to learn about pursuing your Masters or PhD in Germany."
    }
  ]
  
  